{
  "backend/main.mo": "Main backend actor implementing an e-commerce platform with product management, cart operations, order processing, Stripe payment integration, seller product submissions with approval workflow, and role-based access control (admin/user/seller permissions).",
  "backend/migration.mo": "Migration module that upgrades the actor state from an old schema to a new schema by adding sellerSubmissions map and nextSubmissionId counter while preserving existing products, orders, carts, and user profiles.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: adding a Sell button to navigation, creating a Sell page with product listing form and image upload, and connecting the form to backend for product submission approval workflow.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure including routing, authentication, product catalog, cart, checkout with Stripe, and the new seller product submission page with image upload.",
  "frontend/index.css": "Global Tailwind CSS styles defining a playful pink-purple-blue OKLCH color system with comprehensive design tokens for both light and dark modes optimized for a fun squishy/slime aesthetic.",
  "frontend/index.html": "HTML entry point with page title \"Dino Squad\" and root div for React application mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for product catalog, product detail, cart, checkout, payment success/failure, and the new /sell route, wrapped in ThemeProvider with toast notifications and profile setup.",
  "frontend/src/components/CartIcon.tsx": "Shopping cart icon button component displaying item count badge and navigating to cart page on click.",
  "frontend/src/components/Layout.tsx": "Root layout component with sticky header containing Dino Squad branding, navigation with new Sell button, login and cart icons, hero banner image, main content outlet, and footer with social links.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with proper state handling and query cache clearing on logout.",
  "frontend/src/components/ProfileSetup.tsx": "Modal dialog component that prompts authenticated users without a profile to enter their name before shopping. Displays on first login when user profile is null.",
  "frontend/src/components/StripeSetup.tsx": "Admin-only modal dialog for configuring Stripe payment settings including secret key and allowed countries. Shows only when Stripe is not yet configured and user is admin.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control with admin token from URL params. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useCreateCheckoutSession.ts": "Mutation hook that creates a Stripe checkout session by calling the backend actor with shopping items and success/cancel URLs, returning the parsed session with checkout URL.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity. Provides login, logout, and status tracking functionality.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including products, cart, orders, user profiles, seller submissions, admin functions, and Stripe configuration. Handles query invalidation and error states.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a playful pink-purple-blue color palette for light and dark modes, plus base typography styles using system fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with product details, quantities, and total price. Allows item removal and navigation to checkout, with login prompts for unauthenticated users.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that collects shipping information, displays order summary, creates an order in the backend, and redirects to Stripe for payment processing.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page that displays an error message with options to return to cart or retry checkout.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that confirms order completion, invalidates cart cache, and provides a button to continue shopping.",
  "frontend/src/pages/ProductCatalog.tsx": "Product catalog page that displays all products in a grid with filtering options for 'all', 'Paper Squishies', and 'Slime' categories.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that shows product images, description, price, variant selection, and allows adding items to cart with quantity selection.",
  "frontend/src/pages/SellPage.tsx": "Seller submission page where authenticated users can submit products for approval by uploading images and entering product details (name, description, price, category).",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended border radii, custom shadows, and keyframe animations for UI components.",
  "project_state.json": "Project state tracking document for 'Dino Squad' e-commerce platform, listing implemented features including product catalog, shopping cart, checkout with Stripe, seller listing functionality, and admin management capabilities."
}